Ran Plan for dir: `terragrunt/kubernetes/authentik` workspace: `terragrunt_kubernetes_authentik`

<details><summary>Show Output</summary>

```diff
Authenticated

01:01:22.472 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/DBpJ9fyfRaGpeZoibdZVufzatQo/MWSXmplC6pYiQExoLQgvhdOegdE
01:01:22.507 INFO   tofu: Initializing the backend...
01:01:22.779 INFO   tofu: Initializing provider plugins...
01:01:22.779 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:22.986 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:01:23.091 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:23.183 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:23.303 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:23.487 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:01:23.617 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:01:23.825 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:23.938 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:23.971 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:24.005 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:24.025 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:01:24.060 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:24.075 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:24.148 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:24.168 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:24.168 INFO   tofu: OpenTofu has been successfully initialized!
01:01:24.968 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:24.968 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:24.968 STDOUT tofu:   + create
01:01:24.968 STDOUT tofu: OpenTofu will perform the following actions:
01:01:24.968 STDOUT tofu:   # helm_release.authentik will be created
01:01:24.968 STDOUT tofu:   + resource "helm_release" "authentik" {
01:01:24.968 STDOUT tofu:       + atomic                     = false
01:01:24.968 STDOUT tofu:       + chart                      = "authentik"
01:01:24.968 STDOUT tofu:       + cleanup_on_fail            = false
01:01:24.968 STDOUT tofu:       + create_namespace           = false
01:01:24.968 STDOUT tofu:       + dependency_update          = false
01:01:24.968 STDOUT tofu:       + disable_crd_hooks          = false
01:01:24.968 STDOUT tofu:       + disable_openapi_validation = false
01:01:24.968 STDOUT tofu:       + disable_webhooks           = false
01:01:24.968 STDOUT tofu:       + force_update               = false
01:01:24.968 STDOUT tofu:       + id                         = (known after apply)
01:01:24.969 STDOUT tofu:       + lint                       = false
01:01:24.969 STDOUT tofu:       + max_history                = 0
01:01:24.969 STDOUT tofu:       + metadata                   = (known after apply)
01:01:24.969 STDOUT tofu:       + name                       = "authentik"
01:01:24.969 STDOUT tofu:       + namespace                  = "authentik"
01:01:24.969 STDOUT tofu:       + pass_credentials           = false
01:01:24.969 STDOUT tofu:       + recreate_pods              = false
01:01:24.969 STDOUT tofu:       + render_subchart_notes      = true
01:01:24.969 STDOUT tofu:       + replace                    = false
01:01:24.969 STDOUT tofu:       + repository                 = "https://charts.goauthentik.io"
01:01:24.969 STDOUT tofu:       + reset_values               = false
01:01:24.969 STDOUT tofu:       + reuse_values               = false
01:01:24.969 STDOUT tofu:       + skip_crds                  = false
01:01:24.970 STDOUT tofu:       + status                     = "deployed"
01:01:24.970 STDOUT tofu:       + timeout                    = 600
01:01:24.970 STDOUT tofu:       + values                     = [
01:01:24.970 STDOUT tofu:           + <<-EOT
01:01:24.970 STDOUT tofu:                 "authentik":
01:01:24.970 STDOUT tofu:                   "bootstrap_email": "youri@youhide.com.br"
01:01:24.970 STDOUT tofu:                   "email":
01:01:24.970 STDOUT tofu:                     "from": "Authentik <postmaster@mg.tkasolutions.com.br>"
01:01:24.970 STDOUT tofu:                     "host": "smtp.mailgun.org"
01:01:24.970 STDOUT tofu:                     "port": 587
01:01:24.970 STDOUT tofu:                     "use_tls": true
01:01:24.970 STDOUT tofu:                     "username": "postmaster@mg.tkasolutions.com.br"
01:01:24.970 STDOUT tofu:                 "global":
01:01:24.970 STDOUT tofu:                   "env":
01:01:24.970 STDOUT tofu:                   - "name": "AUTHENTIK_SECRET_KEY"
01:01:24.970 STDOUT tofu:                     "valueFrom":
01:01:24.970 STDOUT tofu:                       "secretKeyRef":
01:01:24.970 STDOUT tofu:                         "key": "authentik-secret-key"
01:01:24.971 STDOUT tofu:                         "name": "authentik-secrets"
01:01:24.971 STDOUT tofu:                   - "name": "AUTHENTIK_EMAIL__PASSWORD"
01:01:24.971 STDOUT tofu:                     "valueFrom":
01:01:24.971 STDOUT tofu:                       "secretKeyRef":
01:01:24.971 STDOUT tofu:                         "key": "smtp-password"
01:01:24.971 STDOUT tofu:                         "name": "authentik-secrets"
01:01:24.971 STDOUT tofu:                   - "name": "AUTHENTIK_BOOTSTRAP_PASSWORD"
01:01:24.971 STDOUT tofu:                     "valueFrom":
01:01:24.971 STDOUT tofu:                       "secretKeyRef":
01:01:24.971 STDOUT tofu:                         "key": "token"
01:01:24.971 STDOUT tofu:                         "name": "authentik-secrets"
01:01:24.971 STDOUT tofu:                   - "name": "AUTHENTIK_BOOTSTRAP_TOKEN"
01:01:24.971 STDOUT tofu:                     "valueFrom":
01:01:24.971 STDOUT tofu:                       "secretKeyRef":
01:01:24.971 STDOUT tofu:                         "key": "token"
01:01:24.971 STDOUT tofu:                         "name": "authentik-secrets"
01:01:24.971 STDOUT tofu:                   - "name": "POSTGRES_PASSWORD"
01:01:24.971 STDOUT tofu:                     "valueFrom":
01:01:24.972 STDOUT tofu:                       "secretKeyRef":
01:01:24.972 STDOUT tofu:                         "key": "postgresql-password"
01:01:24.972 STDOUT tofu:                         "name": "authentik-secrets"
01:01:24.972 STDOUT tofu:                 "postgresql":
01:01:24.972 STDOUT tofu:                   "auth":
01:01:24.972 STDOUT tofu:                     "existingSecret": "authentik-secrets"
01:01:24.972 STDOUT tofu:                     "secretKeys":
01:01:24.972 STDOUT tofu:                       "userPasswordKey": "postgresql-password"
01:01:24.972 STDOUT tofu:                   "enabled": true
01:01:24.972 STDOUT tofu:                   "primary":
01:01:24.972 STDOUT tofu:                     "persistence":
01:01:24.972 STDOUT tofu:                       "accessModes":
01:01:24.972 STDOUT tofu:                       - "ReadWriteOnce"
01:01:24.972 STDOUT tofu:                       "size": "4Gi"
01:01:24.972 STDOUT tofu:                       "storageClass": "longhorn"
01:01:24.972 STDOUT tofu:                       "volumeName": "authentik-postgres-volume"
01:01:24.972 STDOUT tofu:                 "redis":
01:01:24.972 STDOUT tofu:                   "enabled": true
01:01:24.972 STDOUT tofu:                   "master":
01:01:24.972 STDOUT tofu:                     "persistence":
01:01:24.972 STDOUT tofu:                       "accessModes":
01:01:24.972 STDOUT tofu:                       - "ReadWriteOnce"
01:01:24.972 STDOUT tofu:                       "size": "2Gi"
01:01:24.972 STDOUT tofu:                       "storageClass": "longhorn"
01:01:24.972 STDOUT tofu:                       "volumeName": "authentik-redis-volume"
01:01:24.972 STDOUT tofu:                 "server":
01:01:24.972 STDOUT tofu:                   "ingress":
01:01:24.972 STDOUT tofu:                     "enabled": true
01:01:24.972 STDOUT tofu:                     "hosts":
01:01:24.972 STDOUT tofu:                     - "auth.tkasolutions.com.br"
01:01:24.972 STDOUT tofu:                     "ingressClassName": "traefik"
01:01:24.972 STDOUT tofu:             EOT,
01:01:24.972 STDOUT tofu:         ]
01:01:24.972 STDOUT tofu:       + verify                     = false
01:01:24.972 STDOUT tofu:       + version                    = "2025.8.2"
01:01:24.972 STDOUT tofu:       + wait                       = true
01:01:24.973 STDOUT tofu:       + wait_for_jobs              = false
01:01:24.973 STDOUT tofu:     }
01:01:24.973 STDOUT tofu:   # kubernetes_manifest.authentik_external_secret will be created
01:01:24.973 STDOUT tofu:   + resource "kubernetes_manifest" "authentik_external_secret" {
01:01:24.973 STDOUT tofu:       + manifest = {
01:01:24.973 STDOUT tofu:           + apiVersion = "external-secrets.io/v1"
01:01:24.973 STDOUT tofu:           + kind       = "ExternalSecret"
01:01:24.973 STDOUT tofu:           + metadata   = {
01:01:24.973 STDOUT tofu:               + name      = "authentik-vault-secrets"
01:01:24.973 STDOUT tofu:               + namespace = "authentik"
01:01:24.973 STDOUT tofu:             }
01:01:24.973 STDOUT tofu:           + spec       = {
01:01:24.973 STDOUT tofu:               + data            = [
01:01:24.973 STDOUT tofu:                   + {
01:01:24.973 STDOUT tofu:                       + remoteRef = {
01:01:24.973 STDOUT tofu:                           + key      = "TKA-Authentik-postgresql-password"
01:01:24.973 STDOUT tofu:                           + property = "password"
01:01:24.973 STDOUT tofu:                         }
01:01:24.973 STDOUT tofu:                       + secretKey = "postgresql-password"
01:01:24.973 STDOUT tofu:                     },
01:01:24.973 STDOUT tofu:                   + {
01:01:24.973 STDOUT tofu:                       + remoteRef = {
01:01:24.973 STDOUT tofu:                           + key      = "TKA-Authentik-secret-key"
01:01:24.973 STDOUT tofu:                           + property = "password"
01:01:24.973 STDOUT tofu:                         }
01:01:24.973 STDOUT tofu:                       + secretKey = "authentik-secret-key"
01:01:24.973 STDOUT tofu:                     },
01:01:24.973 STDOUT tofu:                   + {
01:01:24.973 STDOUT tofu:                       + remoteRef = {
01:01:24.973 STDOUT tofu:                           + key      = "TKA-Authentik-smtp-password"
01:01:24.974 STDOUT tofu:                           + property = "password"
01:01:24.974 STDOUT tofu:                         }
01:01:24.974 STDOUT tofu:                       + secretKey = "smtp-password"
01:01:24.974 STDOUT tofu:                     },
01:01:24.974 STDOUT tofu:                   + {
01:01:24.974 STDOUT tofu:                       + remoteRef = {
01:01:24.974 STDOUT tofu:                           + key      = "TKA-Authentik-token"
01:01:24.974 STDOUT tofu:                           + property = "password"
01:01:24.974 STDOUT tofu:                         }
01:01:24.974 STDOUT tofu:                       + secretKey = "token"
01:01:24.974 STDOUT tofu:                     },
01:01:24.974 STDOUT tofu:                 ]
01:01:24.974 STDOUT tofu:               + refreshInterval = "1h"
01:01:24.974 STDOUT tofu:               + secretStoreRef  = {
01:01:24.974 STDOUT tofu:                   + kind = "ClusterSecretStore"
01:01:24.974 STDOUT tofu:                   + name = "vault-backend"
01:01:24.974 STDOUT tofu:                 }
01:01:24.974 STDOUT tofu:               + target          = {
01:01:24.974 STDOUT tofu:                   + creationPolicy = "Owner"
01:01:24.974 STDOUT tofu:                   + name           = "authentik-secrets"
01:01:24.974 STDOUT tofu:                 }
01:01:24.974 STDOUT tofu:             }
01:01:24.974 STDOUT tofu:         }
01:01:24.974 STDOUT tofu:       + object   = {
01:01:24.974 STDOUT tofu:           + apiVersion = "external-secrets.io/v1"
01:01:24.974 STDOUT tofu:           + kind       = "ExternalSecret"
01:01:24.974 STDOUT tofu:           + metadata   = {
01:01:24.974 STDOUT tofu:               + annotations                = (known after apply)
01:01:24.974 STDOUT tofu:               + creationTimestamp          = (known after apply)
01:01:24.974 STDOUT tofu:               + deletionGracePeriodSeconds = (known after apply)
01:01:24.974 STDOUT tofu:               + deletionTimestamp          = (known after apply)
01:01:24.975 STDOUT tofu:               + finalizers                 = (known after apply)
01:01:24.975 STDOUT tofu:               + generateName               = (known after apply)
01:01:24.975 STDOUT tofu:               + generation                 = (known after apply)
01:01:24.975 STDOUT tofu:               + labels                     = (known after apply)
01:01:24.975 STDOUT tofu:               + managedFields              = (known after apply)
01:01:24.975 STDOUT tofu:               + name                       = "authentik-vault-secrets"
01:01:24.975 STDOUT tofu:               + namespace                  = "authentik"
01:01:24.975 STDOUT tofu:               + ownerReferences            = (known after apply)
01:01:24.975 STDOUT tofu:               + resourceVersion            = (known after apply)
01:01:24.975 STDOUT tofu:               + selfLink                   = (known after apply)
01:01:24.975 STDOUT tofu:               + uid                        = (known after apply)
01:01:24.975 STDOUT tofu:             }
01:01:24.975 STDOUT tofu:           + spec       = {
01:01:24.975 STDOUT tofu:               + data            = [
01:01:24.975 STDOUT tofu:                   + {
01:01:24.975 STDOUT tofu:                       + remoteRef = {
01:01:24.975 STDOUT tofu:                           + conversionStrategy = (known after apply)
01:01:24.975 STDOUT tofu:                           + decodingStrategy   = (known after apply)
01:01:24.975 STDOUT tofu:                           + key                = "TKA-Authentik-postgresql-password"
01:01:24.975 STDOUT tofu:                           + metadataPolicy     = (known after apply)
01:01:24.975 STDOUT tofu:                           + property           = "password"
01:01:24.975 STDOUT tofu:                           + version            = (known after apply)
01:01:24.976 STDOUT tofu:                         }
01:01:24.976 STDOUT tofu:                       + secretKey = "postgresql-password"
01:01:24.976 STDOUT tofu:                       + sourceRef = {
01:01:24.976 STDOUT tofu:                           + generatorRef = {
01:01:24.976 STDOUT tofu:                               + apiVersion = (known after apply)
01:01:24.976 STDOUT tofu:                               + kind       = (known after apply)
01:01:24.976 STDOUT tofu:                               + name       = (known after apply)
01:01:24.976 STDOUT tofu:                             }
01:01:24.976 STDOUT tofu:                           + storeRef     = {
01:01:24.976 STDOUT tofu:                               + kind = (known after apply)
01:01:24.976 STDOUT tofu:                               + name = (known after apply)
01:01:24.976 STDOUT tofu:                             }
01:01:24.976 STDOUT tofu:                         }
01:01:24.976 STDOUT tofu:                     },
01:01:24.976 STDOUT tofu:                   + {
01:01:24.976 STDOUT tofu:                       + remoteRef = {
01:01:24.976 STDOUT tofu:                           + conversionStrategy = (known after apply)
01:01:24.976 STDOUT tofu:                           + decodingStrategy   = (known after apply)
01:01:24.976 STDOUT tofu:                           + key                = "TKA-Authentik-secret-key"
01:01:24.976 STDOUT tofu:                           + metadataPolicy     = (known after apply)
01:01:24.976 STDOUT tofu:                           + property           = "password"
01:01:24.976 STDOUT tofu:                           + version            = (known after apply)
01:01:24.976 STDOUT tofu:                         }
01:01:24.976 STDOUT tofu:                       + secretKey = "authentik-secret-key"
01:01:24.976 STDOUT tofu:                       + sourceRef = {
01:01:24.976 STDOUT tofu:                           + generatorRef = {
01:01:24.976 STDOUT tofu:                               + apiVersion = (known after apply)
01:01:24.977 STDOUT tofu:                               + kind       = (known after apply)
01:01:24.977 STDOUT tofu:                               + name       = (known after apply)
01:01:24.977 STDOUT tofu:                             }
01:01:24.977 STDOUT tofu:                           + storeRef     = {
01:01:24.977 STDOUT tofu:                               + kind = (known after apply)
01:01:24.977 STDOUT tofu:                               + name = (known after apply)
01:01:24.977 STDOUT tofu:                             }
01:01:24.977 STDOUT tofu:                         }
01:01:24.977 STDOUT tofu:                     },
01:01:24.977 STDOUT tofu:                   + {
01:01:24.977 STDOUT tofu:                       + remoteRef = {
01:01:24.977 STDOUT tofu:                           + conversionStrategy = (known after apply)
01:01:24.977 STDOUT tofu:                           + decodingStrategy   = (known after apply)
01:01:24.977 STDOUT tofu:                           + key                = "TKA-Authentik-smtp-password"
01:01:24.977 STDOUT tofu:                           + metadataPolicy     = (known after apply)
01:01:24.977 STDOUT tofu:                           + property           = "password"
01:01:24.977 STDOUT tofu:                           + version            = (known after apply)
01:01:24.977 STDOUT tofu:                         }
01:01:24.977 STDOUT tofu:                       + secretKey = "smtp-password"
01:01:24.977 STDOUT tofu:                       + sourceRef = {
01:01:24.977 STDOUT tofu:                           + generatorRef = {
01:01:24.977 STDOUT tofu:                               + apiVersion = (known after apply)
01:01:24.977 STDOUT tofu:                               + kind       = (known after apply)
01:01:24.977 STDOUT tofu:                               + name       = (known after apply)
01:01:24.977 STDOUT tofu:                             }
01:01:24.977 STDOUT tofu:                           + storeRef     = {
01:01:24.978 STDOUT tofu:                               + kind = (known after apply)
01:01:24.978 STDOUT tofu:                               + name = (known after apply)
01:01:24.978 STDOUT tofu:                             }
01:01:24.978 STDOUT tofu:                         }
01:01:24.978 STDOUT tofu:                     },
01:01:24.978 STDOUT tofu:                   + {
01:01:24.978 STDOUT tofu:                       + remoteRef = {
01:01:24.978 STDOUT tofu:                           + conversionStrategy = (known after apply)
01:01:24.978 STDOUT tofu:                           + decodingStrategy   = (known after apply)
01:01:24.978 STDOUT tofu:                           + key                = "TKA-Authentik-token"
01:01:24.978 STDOUT tofu:                           + metadataPolicy     = (known after apply)
01:01:24.978 STDOUT tofu:                           + property           = "password"
01:01:24.978 STDOUT tofu:                           + version            = (known after apply)
01:01:24.978 STDOUT tofu:                         }
01:01:24.978 STDOUT tofu:                       + secretKey = "token"
01:01:24.978 STDOUT tofu:                       + sourceRef = {
01:01:24.978 STDOUT tofu:                           + generatorRef = {
01:01:24.978 STDOUT tofu:                               + apiVersion = (known after apply)
01:01:24.978 STDOUT tofu:                               + kind       = (known after apply)
01:01:24.978 STDOUT tofu:                               + name       = (known after apply)
01:01:24.978 STDOUT tofu:                             }
01:01:24.978 STDOUT tofu:                           + storeRef     = {
01:01:24.978 STDOUT tofu:                               + kind = (known after apply)
01:01:24.978 STDOUT tofu:                               + name = (known after apply)
01:01:24.978 STDOUT tofu:                             }
01:01:24.978 STDOUT tofu:                         }
01:01:24.978 STDOUT tofu:                     },
01:01:24.978 STDOUT tofu:                 ]
01:01:24.979 STDOUT tofu:               + dataFrom        = (known after apply)
01:01:24.979 STDOUT tofu:               + refreshInterval = "1h"
01:01:24.979 STDOUT tofu:               + refreshPolicy   = (known after apply)
01:01:24.979 STDOUT tofu:               + secretStoreRef  = {
01:01:24.979 STDOUT tofu:                   + kind = "ClusterSecretStore"
01:01:24.979 STDOUT tofu:                   + name = "vault-backend"
01:01:24.979 STDOUT tofu:                 }
01:01:24.979 STDOUT tofu:               + target          = {
01:01:24.979 STDOUT tofu:                   + creationPolicy = "Owner"
01:01:24.979 STDOUT tofu:                   + deletionPolicy = (known after apply)
01:01:24.979 STDOUT tofu:                   + immutable      = (known after apply)
01:01:24.979 STDOUT tofu:                   + name           = "authentik-secrets"
01:01:24.979 STDOUT tofu:                   + template       = {
01:01:24.979 STDOUT tofu:                       + data          = (known after apply)
01:01:24.979 STDOUT tofu:                       + engineVersion = (known after apply)
01:01:24.979 STDOUT tofu:                       + mergePolicy   = (known after apply)
01:01:24.979 STDOUT tofu:                       + metadata      = {
01:01:24.979 STDOUT tofu:                           + annotations = (known after apply)
01:01:24.979 STDOUT tofu:                           + labels      = (known after apply)
01:01:24.979 STDOUT tofu:                         }
01:01:24.979 STDOUT tofu:                       + templateFrom  = (known after apply)
01:01:24.979 STDOUT tofu:                       + type          = (known after apply)
01:01:24.979 STDOUT tofu:                     }
01:01:24.979 STDOUT tofu:                 }
01:01:24.979 STDOUT tofu:             }
01:01:24.979 STDOUT tofu:         }
01:01:24.979 STDOUT tofu:     }
01:01:24.979 STDOUT tofu:   # kubernetes_namespace.authentik will be created
01:01:24.979 STDOUT tofu:   + resource "kubernetes_namespace" "authentik" {
01:01:24.979 STDOUT tofu:       + id                               = (known after apply)
01:01:24.980 STDOUT tofu:       + wait_for_default_service_account = false
01:01:24.980 STDOUT tofu:       + metadata {
01:01:24.980 STDOUT tofu:           + generation       = (known after apply)
01:01:24.980 STDOUT tofu:           + name             = "authentik"
01:01:24.980 STDOUT tofu:           + resource_version = (known after apply)
01:01:24.980 STDOUT tofu:           + uid              = (known after apply)
01:01:24.980 STDOUT tofu:         }
01:01:24.980 STDOUT tofu:     }
01:01:24.980 STDOUT tofu: Plan: 3 to add, 0 to change, 0 to destroy.
01:01:24.980 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/authentik -w terragrunt_kubernetes_authentik
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Fauthentik%252Fterragrunt_kubernetes_authentik)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/authentik -w terragrunt_kubernetes_authentik
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```